J2bToyo/rx621_toppers/kernel/arch/rx_rxc/rx621.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2008-2010 by Witz Corporation, JAPAN
 * 
 *  上記著作権者は，以下の(1)～(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 */

/////////////////////////////////////////////////////////////////////////////////////////
// START 2020.10.1【修正】rx610.hを元に、RX621に合わせこみ
/////////////////////////////////////////////////////////////////////////////////////////

/*
 *  RX621に依存する定義
 */
#ifndef TOPPERS_RX621_H
#define TOPPERS_RX621_H

/*
 *  CPU例外ハンドラ番号の定義(固定ベクタテーブル)
 *
 *  番号の範囲は0 - 31
 */
#define INT_PRIVILEGED_INSTRUNCTION		20		/* 特権命令例外 */
#define INT_UNDEF_INSTRUNCTION			23		/* 未定義命令例外 */
#define INT_FLOATINGPOINT_INSTRUCTION	25		/* 浮動小数点例外 */
#define INT_NMI							30		/* ノンマスカブル割り込み */
#define INT_RESET						31		/* リセット */

/*
 *  割込み番号の定義(可変ベクタテーブル)
 */
#define INT_BUSERR 				16
#define INT_FCU_FIFERR 			21
#define INT_FCU_FRDYI 			23
#define INT_ICU_SWINT			27
#define INT_CMT0_CMI0 			28
#define INT_CMT1_CMI1 			29
#define INT_CMT2_CMI2 			30
#define INT_CMT3_CMI3 			31
#define INT_ETHER_EINT 			32
#define INT_USB0_D0FIFO0 		36
#define INT_USB0_D1FIFO0 		37
#define INT_USB0_USBI0 			38
#define INT_USB1_D0FIFO1 		40
#define INT_USB1_D1FIFO1 		41
#define INT_USB1_USBI1 			42
#define INT_RSPI0_SPEI0 		44
#define INT_RSPI0_SPRI0 		45
#define INT_RSPI0_SPTI0 		46
#define INT_RSPI0_SPII0 		47
#define INT_RSPI1_SPEI1 		48
#define INT_RSPI1_SPRI1 		49
#define INT_RSPI1_SPTI1 		50
#define INT_RSPI1_SPII1 		51
#define INT_CAN0_ERS0 			56
#define INT_CAN0_RXF0 			57
#define INT_CAN0_TXF0 			58
#define INT_CAN0_RXM0 			59
#define INT_CAN0_TXM0 			60
#define INT_RTC_PRD 			62
#define INT_RTC_CUP 			63
#define INT_IRQ0 				64
#define INT_IRQ1 				65
#define INT_IRQ2 				66
#define INT_IRQ3 				67
#define INT_IRQ4 				68
#define INT_IRQ5 				69
#define INT_IRQ6 				70
#define INT_IRQ7 				71
#define INT_IRQ8 				72
#define INT_IRQ9 				73
#define INT_IRQ10 				74
#define INT_IRQ11 				75
#define INT_IRQ12 				76
#define INT_IRQ13 				77
#define INT_IRQ14 				78
#define INT_IRQ15 				79
#define INT_USB_USBR0 			90
#define INT_USB_USBR1 			91
#define INT_RTC_ALM 			92
#define INT_WDT_WOVI 			96
#define INT_AD0_ADI0 			98
#define INT_AD1_ADI1 			99
#define INT_S12AD_S12ADI0 		102
#define INT_MTU0_TGIA0 			114
#define INT_MTU0_TGIB0 			115
#define INT_MTU0_TGIC0 			116
#define INT_MTU0_TGID0 			117
#define INT_MTU0_TCIV0 			118
#define INT_MTU0_TGIE0			119
#define INT_MTU0_TGIF0 			120
#define INT_MTU1_TGIA1 			121
#define INT_MTU1_TGIB1 			122
#define INT_MTU1_TCIV1 			123
#define INT_MTU1_TCIU1 			124
#define INT_MTU2_TGIA2 			125
#define INT_MTU2_TGIB2 			126
#define INT_MTU2_TCIV2 			127
#define INT_MTU2_TCIU2 			128
#define INT_MTU3_TGIA3 			129
#define INT_MTU3_TGIB3 			130
#define INT_MTU3_TGIC3 			131
#define INT_MTU3_TGID3 			132
#define INT_MTU3_TCIV3 			133
#define INT_MTU4_TGIA4 			134
#define INT_MTU4_TGIB4 			135
#define INT_MTU4_TGIC4 			136
#define INT_MTU4_TGID4 			137
#define INT_MTU4_TCIV4 			138
#define INT_MTU5_TGIU5 			139
#define INT_MTU5_TGIV5 			140
#define INT_MTU5_TGIW5 			141
#define INT_MTU6_TGIA6 			142
#define INT_MTU6_TGIB6 			143
#define INT_MTU6_TGIC6 			144
#define INT_MTU6_TGID6 			145
#define INT_MTU6_TCIV6 			146
#define INT_MTU6_TGIE6 			147
#define INT_MTU6_TGIF6 			148
#define INT_MTU7_TGIA7 			149
#define INT_MTU7_TGIB7 			150
#define INT_MTU7_TCIV7 			151
#define INT_MTU7_TCIU7 			152
#define INT_MTU8_TGIA8 			153
#define INT_MTU8_TGIB8 			154
#define INT_MTU8_TCIV8 			155
#define INT_MTU8_TCIU8 			156
#define INT_MTU9_TGIA9 			157
#define INT_MTU9_TGIB9 			158
#define INT_MTU9_TGIC9 			159
#define INT_MTU9_TGID9 			160
#define INT_MTU9_TCIV9 			161
#define INT_MTU10_TGIA10 		162
#define INT_MTU10_TGIB10 		163
#define INT_MTU10_TGIC10 		164
#define INT_MTU10_TGID10 		165
#define INT_MTU10_TCIV10 		166
#define INT_MTU11_TGIU11 		167
#define INT_MTU11_TGIV11 		168
#define INT_MTU11_TGIW11 		169
#define INT_POE_OEI1 			170
#define INT_POE_OEI2 			171
#define INT_POE_OEI3 			172
#define INT_POE_OEI4 			173
#define INT_TMR0_CMIA0 			174
#define INT_TMR0_CMIB0 			175
#define INT_TMR0_OVI0 			176
#define INT_TMR1_CMIA1 			177
#define INT_TMR1_CMIB1 			178
#define INT_TMR1_OVI1 			179
#define INT_TMR2_CMIA2 			180
#define INT_TMR2_CMIB2 			181
#define INT_TMR2_OVI2 			182
#define INT_TMR3_CMIA3 			183
#define INT_TMR3_CMIB3 			184
#define INT_TMR3_OVI3 			185
#define INT_DMACA_DMACI0 		198
#define INT_DMACA_DMACI1 		199
#define INT_DMACA_DMACI2 		200
#define INT_DMACA_DMACI3 		201
#define INT_EXDMAC_EXDMACI0 	202
#define INT_EXDMAC_EXDMACI1 	203
#define INT_SCI0_ERI0 			214
#define INT_SCI0_RXI0 			215
#define INT_SCI0_TXI0			216
#define INT_SCI0_TEI0 			217
#define INT_SCI1_ERI1 			218
#define INT_SCI1_RXI1 			219
#define INT_SCI1_TXI1 			220
#define INT_SCI1_TEI1	 		221
#define INT_SCI2_ERI2 			222
#define INT_SCI2_RXI2 			223
#define INT_SCI2_TXI2 			224
#define INT_SCI2_TEI2 			225
#define INT_SCI3_ERI3	 		226
#define INT_SCI3_RXI3 			227
#define INT_SCI3_TXI3 			228
#define INT_SCI3_TEI3 			229
#define INT_SCI5_ERI5 			234
#define INT_SCI5_RXI5 			235
#define INT_SCI5_TXI5 			236
#define INT_SCI5_TEI5 			237
#define INT_SCI6_ERI6 			238
#define INT_SCI6_RXI6 			239
#define INT_SCI6_TXI6 			240
#define INT_SCI6_TEI6 			241
#define INT_RIIC0_ICEEI0 		246
#define INT_RIIC0_ICRXI0 		247
#define INT_RIIC0_ICTXI0 		248
#define INT_RIIC0_ICTEI0 		249
#define INT_RIIC1_ICEEI1 		250
#define INT_RIIC1_ICRXI1 		251
#define INT_RIIC1_ICTXI1 		252
#define INT_RIIC1_ICTEI1 		253

