J2bToyo/rx621_toppers/kernel/arch/rx_rxc/rx621.h
/*
 * DTC起動許可レジスタ
 */
#define ICU_DTCER027_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008711B )
#define ICU_DTCER028_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008711C )
#define ICU_DTCER029_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008711D )
#define ICU_DTCER030_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008711E )
#define ICU_DTCER031_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008711F )
#define ICU_DTCER036_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087124 )
#define ICU_DTCER037_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087125 )
#define ICU_DTCER040_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087128 )
#define ICU_DTCER041_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087129 )
#define ICU_DTCER045_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008712D )
#define ICU_DTCER046_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008712E )
#define ICU_DTCER049_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087131 )
#define ICU_DTCER050_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087132 )
#define ICU_DTCER064_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087140 )
#define ICU_DTCER065_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087141 )
#define ICU_DTCER066_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087142 )
#define ICU_DTCER067_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087143 )
#define ICU_DTCER068_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087144 )
#define ICU_DTCER069_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087145 )
#define ICU_DTCER070_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087146 )
#define ICU_DTCER071_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087147 )
#define ICU_DTCER072_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087148 )
#define ICU_DTCER073_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087149 )
#define ICU_DTCER074_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008714A )
#define ICU_DTCER075_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008714B )
#define ICU_DTCER076_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008714C )
#define ICU_DTCER077_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008714D )
#define ICU_DTCER078_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008714E )
#define ICU_DTCER079_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008714F )
#define ICU_DTCER098_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087162 )
#define ICU_DTCER099_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087163 )
#define ICU_DTCER102_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087166 )
#define ICU_DTCER114_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087172 )
#define ICU_DTCER115_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087173 )
#define ICU_DTCER116_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087174 )
#define ICU_DTCER117_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087175 )
#define ICU_DTCER121_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087179 )
#define ICU_DTCER122_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008717A )
#define ICU_DTCER125_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008717D )
#define ICU_DTCER126_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008717E )
#define ICU_DTCER129_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087181 )
#define ICU_DTCER130_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087182 )
#define ICU_DTCER131_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087183 )
#define ICU_DTCER132_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087184 )
#define ICU_DTCER134_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087186 )
#define ICU_DTCER135_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087187 )
#define ICU_DTCER136_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087188 )
#define ICU_DTCER137_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087189 )
#define ICU_DTCER138_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008718A )
#define ICU_DTCER139_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008718B )
#define ICU_DTCER140_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008718C )
#define ICU_DTCER141_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008718D )
#define ICU_DTCER142_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008718E )
#define ICU_DTCER143_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008718F )
#define ICU_DTCER144_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087190 )
#define ICU_DTCER145_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087191 )
#define ICU_DTCER149_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087195 )
#define ICU_DTCER150_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087196 )
#define ICU_DTCER153_ADDR 		( ( volatile uint8_t __evenaccess * )0x00087199 )
#define ICU_DTCER154_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008719A )
#define ICU_DTCER157_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008719D )
#define ICU_DTCER158_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008719E )
#define ICU_DTCER159_ADDR 		( ( volatile uint8_t __evenaccess * )0x0008719F )
#define ICU_DTCER160_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A0 )
#define ICU_DTCER162_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A2 )
#define ICU_DTCER163_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A3 )
#define ICU_DTCER164_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A4 )
#define ICU_DTCER165_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A5 )
#define ICU_DTCER166_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A6 )
#define ICU_DTCER167_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A7 )
#define ICU_DTCER168_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A8 )
#define ICU_DTCER169_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871A9 )
#define ICU_DTCER174_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871AE )
#define ICU_DTCER175_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871AF )
#define ICU_DTCER177_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871B1 )
#define ICU_DTCER178_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871B2 )
#define ICU_DTCER180_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871B4 )
#define ICU_DTCER181_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871B5 )
#define ICU_DTCER183_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871B7 )
#define ICU_DTCER184_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871B8 )
#define ICU_DTCER198_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871C6 )
#define ICU_DTCER199_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871C7 )
#define ICU_DTCER200_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871C8 )
#define ICU_DTCER201_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871C9 )
#define ICU_DTCER202_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871CA )
#define ICU_DTCER203_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871CB )
#define ICU_DTCER215_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871D7 )
#define ICU_DTCER216_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871D8 )
#define ICU_DTCER219_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871DB )
#define ICU_DTCER220_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871DC )
#define ICU_DTCER223_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871DF )
#define ICU_DTCER224_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871E0 )
#define ICU_DTCER227_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871E3 )
#define ICU_DTCER228_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871E4 )
#define ICU_DTCER235_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871EB )
#define ICU_DTCER236_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871EC )
#define ICU_DTCER239_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871EF )
#define ICU_DTCER240_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871F0 )
#define ICU_DTCER247_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871F7 )
#define ICU_DTCER248_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871F8 )
#define ICU_DTCER251_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871FB )
#define ICU_DTCER252_ADDR 		( ( volatile uint8_t __evenaccess * )0x000871FC )
#define ICU_DTCE_BIT			( 1U << 0U )


