J2bToyo/rx621_toppers/kernel/arch/rx_rxc/rx621.h
/*
 * 割り込み要求許可レジスタ
 */
#define ICU_IER02_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087202 )
#define ICU_IER03_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087203 )
#define ICU_IER04_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087204 )
#define ICU_IER05_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087205 )
#define ICU_IER06_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087206 )
#define ICU_IER07_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087207 )
#define ICU_IER08_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087208 )
#define ICU_IER09_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087209 )
#define ICU_IER0B_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008720B )
#define ICU_IER0C_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008720C )
#define ICU_IER0E_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008720E )
#define ICU_IER0F_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008720F )
#define ICU_IER10_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087210 )
#define ICU_IER11_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087211 )
#define ICU_IER12_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087212 )
#define ICU_IER13_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087213 )
#define ICU_IER14_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087214 )
#define ICU_IER15_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087215 )
#define ICU_IER16_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087216 )
#define ICU_IER17_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087217 )
#define ICU_IER18_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087218 )
#define ICU_IER19_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087219 )
#define ICU_IER1A_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008721A )
#define ICU_IER1B_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008721B )
#define ICU_IER1C_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008721C )
#define ICU_IER1D_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008721D )
#define ICU_IER1E_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008721E )
#define ICU_IER1F_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008721F )
#define ICU_IEN0_BIT			( 1U << 0U )
#define ICU_IEN1_BIT			( 1U << 1U )
#define ICU_IEN2_BIT			( 1U << 2U )
#define ICU_IEN3_BIT			( 1U << 3U )
#define ICU_IEN4_BIT			( 1U << 4U )
#define ICU_IEN5_BIT			( 1U << 5U )
#define ICU_IEN6_BIT			( 1U << 6U )
#define ICU_IEN7_BIT			( 1U << 7U )


/*
 * ソフトウェア割り込み起動レジスタ
*/
#define ICU_SWINTR_ADDR 		( ( volatile uint8_t __evenaccess * )0x000872E0 )
#define ICU_SWINT_BIT			( 1U << 0U )


/*
 * 高速割り込み設定レジス
*/
#define ICU_FIR_ADDR  			( ( volatile uint16_t __evenaccess * )0x000872F0 )
#define ICU_SIEN_BIT			( 1U << 15U )


/* 
 * 割り込み要因プライオリティレジスタi(m=00h～8Fh)の設定
 */
#define ICU_IPR00_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087300 )
#define ICU_IPR01_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087301 )
#define ICU_IPR02_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087302 )
#define ICU_IPR03_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087303 )
#define ICU_IPR04_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087304 )
#define ICU_IPR05_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087305 )
#define ICU_IPR06_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087306 )
#define ICU_IPR07_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087307 )
#define ICU_IPR08_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087308 )
#define ICU_IPR0C_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008730C )
#define ICU_IPR0D_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008730D )
#define ICU_IPR0E_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008730E )
#define ICU_IPR10_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087310 )
#define ICU_IPR11_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087311 )
#define ICU_IPR12_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087312 )
#define ICU_IPR14_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087314 )
#define ICU_IPR15_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087315 )
#define ICU_IPR18_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087318 )
#define ICU_IPR1E_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008731E )
#define ICU_IPR1F_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008731F )
#define ICU_IPR20_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087320 )
#define ICU_IPR21_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087321 )
#define ICU_IPR22_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087322 )
#define ICU_IPR23_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087323 )
#define ICU_IPR24_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087324 )
#define ICU_IPR25_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087325 )
#define ICU_IPR26_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087326 )
#define ICU_IPR27_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087327 )
#define ICU_IPR28_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087328 )
#define ICU_IPR29_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087329 )
#define ICU_IPR2A_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008732A )
#define ICU_IPR2B_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008732B )
#define ICU_IPR2C_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008732C )
#define ICU_IPR2D_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008732D )
#define ICU_IPR2E_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008732E )
#define ICU_IPR2F_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008732F )
#define ICU_IPR3A_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008733A )
#define ICU_IPR3B_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008733B )
#define ICU_IPR3C_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008733C )
#define ICU_IPR40_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087340 )
#define ICU_IPR44_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087344 )
#define ICU_IPR45_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087345 )
#define ICU_IPR48_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087348 )
#define ICU_IPR51_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087351 )
#define ICU_IPR52_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087352 )
#define ICU_IPR53_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087353 )
#define ICU_IPR54_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087354 )
#define ICU_IPR55_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087355 )
#define ICU_IPR56_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087356 )
#define ICU_IPR57_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087357 )
#define ICU_IPR58_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087358 )
#define ICU_IPR59_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087359 )
#define ICU_IPR5A_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008735A )
#define ICU_IPR5B_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008735B )
#define ICU_IPR5C_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008735C )
#define ICU_IPR5D_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008735D )
#define ICU_IPR5E_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008735E )
#define ICU_IPR5F_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008735F )
#define ICU_IPR60_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087360 )
#define ICU_IPR61_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087361 )
#define ICU_IPR62_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087362 )
#define ICU_IPR63_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087363 )
#define ICU_IPR64_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087364 )
#define ICU_IPR65_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087365 )
#define ICU_IPR66_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087366 )
#define ICU_IPR67_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087367 )
#define ICU_IPR68_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087368 )
#define ICU_IPR69_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087369 )
#define ICU_IPR6A_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008736A )
#define ICU_IPR6B_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008736B )
#define ICU_IPR70_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087370 )
#define ICU_IPR71_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087371 )
#define ICU_IPR72_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087372 )
#define ICU_IPR73_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087373 )
#define ICU_IPR74_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087374 )
#define ICU_IPR75_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087375 )
#define ICU_IPR80_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087380 )
#define ICU_IPR81_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087381 )
#define ICU_IPR82_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087382 )
#define ICU_IPR83_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087383 )
#define ICU_IPR85_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087385 )
#define ICU_IPR86_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087386 )
#define ICU_IPR88_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087388 )
#define ICU_IPR89_ADDR 			( ( volatile uint8_t __evenaccess * )0x00087389 )
#define ICU_IPR8A_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008738A )
#define ICU_IPR8B_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008738B )
#define ICU_IPR8C_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008738C )
#define ICU_IPR8D_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008738D )
#define ICU_IPR8E_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008738E )
#define ICU_IPR8F_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008738F )
#define ICU_IPR_BIT				( 7U << 0U )


