J2bToyo/rx621_toppers/kernel/arch/rx_rxc/rx621.h
/*
 * DMACA起動要因選択レジスタ0
*/
#define ICU_DMRSR0_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087400 )
#define ICU_DMRSR1_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087404 )
#define ICU_DMRSR2_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087408 )
#define ICU_DMRSR3_ADDR  		( ( volatile uint8_t __evenaccess * )0x0008740C )


/*
 *  IRQコントロールレジスタ
 */
#define ICU_IRQ0_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087500 )
#define ICU_IRQ1_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087501 )
#define ICU_IRQ2_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087502 )
#define ICU_IRQ3_ADDR 	 		( ( volatile uint8_t __evenaccess * )0x00087503 )
#define ICU_IRQ4_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087504 )
#define ICU_IRQ5_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087505 )
#define ICU_IRQ6_ADDR 	 		( ( volatile uint8_t __evenaccess * )0x00087506 )
#define ICU_IRQ7_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087507 )
#define ICU_IRQ8_ADDR  			( ( volatile uint8_t __evenaccess * )0x00087508 )
#define ICU_IRQ9_ADDR 	 		( ( volatile uint8_t __evenaccess * )0x00087509 )
#define ICU_IRQ10_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008750A )
#define ICU_IRQ11_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008750B )
#define ICU_IRQ12_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008750C )
#define ICU_IRQ13_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008750D )
#define ICU_IRQ14_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008750E )
#define ICU_IRQ15_ADDR 			( ( volatile uint8_t __evenaccess * )0x0008750F )
#define ICU_IRQMD_BIT			( 3U << 2U )


/*
 * ノンマスカブル割り込みステータスレジスタ
*/
#define ICU_NMISR_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087580 )
#define ICU_OSTST_BIT			( 1U << 2U )
#define ICU_LVDST_BIT			( 1U << 1U )
#define ICU_NMIST_BIT			( 1U << 0U )


/*
 * ノンマスカブル割り込み許可レジスタ
*/
#define ICU_NMIER_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087581 )
#define ICU_OSTEN_BIT			( 1U << 2U )
#define ICU_LVDEN_BIT			( 1U << 1U )
#define ICU_NMIEN_BIT			( 1U << 0U )


/*
 * ノンマスカブル割り込みクリアレジスタ
*/
#define ICU_NMICLR_ADDR		 	( ( volatile uint8_t __evenaccess * )0x00087582 )
#define ICU_OSTCLR_BIT			( 1U << 2U )
#define ICU_NMICLR_BIT			( 1U << 0U )


/*
 * NMI端子割り込みコントロールレジスタ
*/
#define ICU_NMICR_ADDR  		( ( volatile uint8_t __evenaccess * )0x00087583 )
#define ICU_NMIMD_BIT			( 1U << 3U )


/*
 *  各チャンネルのレジスタ及び設定ビット情報
 */
#define CMT_CMSTR0_ADDR			( ( volatile uint16_t __evenaccess * )0x00088000 )
#define CMT_CMSTR0_STR0_BIT		( 1U << 0U )
#define CMT_CMSTR0_STR1_BIT		( 1U << 1U )
#define CMT_CMSTR1_ADDR			( ( volatile uint16_t __evenaccess * )0x00088010 )
#define CMT_CMSTR1_STR2_BIT		( 1U << 0U )
#define CMT_CMSTR1_STR3_BIT		( 1U << 1U )
#define CMT0_CMCR_ADDR			( ( volatile uint16_t __evenaccess * )0x00088002 )
#define CMT0_CMCR_CKS_BIT		( 3U )
#define CMT0_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT1_CMCR_ADDR			( ( volatile uint16_t __evenaccess * )0x00088008 )
#define CMT1_CMCR_CKS_BIT		( 3U )
#define CMT1_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT2_CMCR_ADDR			( ( volatile uint16_t __evenaccess * )0x00088012 )
#define CMT2_CMCR_CKS_BIT		( 3U)
#define CMT2_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT3_CMCR_ADDR			( ( volatile uint16_t __evenaccess * )0x00088018 )
#define CMT3_CMCR_CKS_BIT		( 3U )
#define CMT3_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT0_CMCNT_ADDR			( ( volatile uint16_t __evenaccess * )0x00088004 )
#define CMT1_CMCNT_ADDR			( ( volatile uint16_t __evenaccess * )0x0008800A )
#define CMT2_CMCNT_ADDR			( ( volatile uint16_t __evenaccess * )0x00088014 )
#define CMT3_CMCNT_ADDR			( ( volatile uint16_t __evenaccess * )0x0008801A )
#define CMT0_CMCOR_ADDR			( ( volatile uint16_t __evenaccess * )0x00088006 )
#define CMT1_CMCOR_ADDR			( ( volatile uint16_t __evenaccess * )0x0008800C )
#define CMT2_CMCOR_ADDR			( ( volatile uint16_t __evenaccess * )0x00088016 )
#define CMT3_CMCOR_ADDR			( ( volatile uint16_t __evenaccess * )0x0008801C )

#define SCI0_SMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088240 )
#define SCI0_BRR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088241 )
#define SCI0_SCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088242 )
#define SCI0_TDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088243 )
#define SCI0_SSR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088244 )
#define SCI0_RDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088245 )
#define SCI0_SCMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088246 )
#define SCI0_SEMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088247 )
#define SCI1_SMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088248 )
#define SCI1_BRR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088249 )
#define SCI1_SCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008824A )
#define SCI1_TDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008824B )
#define SCI1_SSR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008824C )
#define SCI1_RDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008824D )
#define SCI1_SCMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008824E )
#define SCI1_SEMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008824F )
#define SCI2_SMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088250 )
#define SCI2_BRR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088251 )
#define SCI2_SCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088252 )
#define SCI2_TDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088253 )
#define SCI2_SSR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088254 )
#define SCI2_RDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088255 )
#define SCI2_SCMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088256 )
#define SCI2_SEMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088257 )
#define SCI3_SMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088258 )
#define SCI3_BRR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088259 )
#define SCI3_SCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008825A )
#define SCI3_TDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008825B )
#define SCI3_SSR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008825C )
#define SCI3_RDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008825D )
#define SCI3_SCMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008825E )
#define SCI3_SEMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008825F )
#define SCI5_SMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088268 )
#define SCI5_BRR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088269 )
#define SCI5_SCR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008826A )
#define SCI5_TDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008826B )
#define SCI5_SSR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008826C )
#define SCI5_RDR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008826D )
#define SCI5_SCMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008826E )
#define SCI5_SEMR_ADDR			( ( volatile uint8_t __evenaccess * )0x0008826F )
#define SCI6_SMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088270 )
#define SCI6_BRR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088271 )
#define SCI6_SCR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088272 )
#define SCI6_TDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088273 )
#define SCI6_SSR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088274 )
#define SCI6_RDR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088275 )
#define SCI6_SCMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088276 )
#define SCI6_SEMR_ADDR			( ( volatile uint8_t __evenaccess * )0x00088277 )
#define SCI_SMR_CKS_BIT			( 3U << 0U )
#define SCI_SMR_STOP_BIT		( 1U << 3U )
#define SCI_SMR_PM_BIT			( 1U << 4U )
#define SCI_SMR_PE_BIT			( 1U << 5U )
#define SCI_SMR_CHR_BIT			( 1U << 6U )
#define SCI_SMR_CM_BIT			( 1U << 7U )
#define SCI_SCR_CKE_BIT			( 3U << 0U )
#define SCI_SCR_TEIE_BIT		( 1U << 2U )
#define SCI_SCR_RE_BIT			( 1U << 4U )
#define SCI_SCR_TE_BIT			( 1U << 5U )
#define SCI_SCR_RIE_BIT			( 1U << 6U )
#define SCI_SCR_TIE_BIT			( 1U << 7U )
#define SCI_SSR_TEND_BIT		( 1U << 2U )
#define SCI_SSR_PER_BIT			( 1U << 3U )
#define SCI_SSR_FER_BIT			( 1U << 4U )
#define SCI_SSR_ORER_BIT		( 1U << 5U )
#define SCI_SCMR_SMIF_BIT		( 1U << 0U )
#define SCI_SCMR_SINV_BIT		( 1U << 2U )
#define SCI_SCMR_SDIR_BIT		( 1U << 3U )
#define SCI_SCMR_BCP2_BIT		( 1U << 7U )
#define SCI_SEMR_ACS0_BIT		( 1U << 0U )
#define SCI_SEMR_ABCS_BIT		( 1U << 4U )

